# 인덱싱에 자주 쓰는 메소드
* ix[] - 기본(base) 인덱싱, 가장 많이 사용한다. 라벨 인덱싱과 정수(integer)인덱싱에 둘 다 사용
* loc[] - 라벨(label) 인덱싱, ix 다음으로 많이 사용
* iloc[] - 위치(positional) 인덱싱, 정수(integer)로 인덱싱할 때 사용
* xs() - 다중 인덱스 추출에 사용
* iat[], at[] - 거의 쓰지 않는다


loc는 라벨, iloc 위치(정수값)기반으로 동작한다.
ix는 인덱스가 라벨인 경우 loc로 동작하며, 인덱스가 레이블이 아닌경우에는 iloc로 동작한다.

In [1]:
from IPython.display import display
import pandas as pd

In [2]:
df = pd.DataFrame({'A':['KO', 'US', 'EU', 'US', 'EU'], 'B':[54, 67, 89, 203, 101], 'C':['Seoul', 'New york', 'Paris', 'LA', 'London']})
df

    A    B         C
0  KO   54     Seoul
1  US   67  New york
2  EU   89     Paris
3  US  203        LA
4  EU  101    London

# 불린 인덱스

In [3]:
df[ df['A'] == 'EU' ]

    A    B       C
2  EU   89   Paris
4  EU  101  London

# iloc (위치 인덱스)

In [4]:
df.iloc[0]

A       KO
B       54
C    Seoul
Name: 0, dtype: object

In [5]:
df.iloc[1:3]

    A   B         C
1  US  67  New york
2  EU  89     Paris

In [6]:
df.loc[1:3]

    A    B         C
1  US   67  New york
2  EU   89     Paris
3  US  203        LA

# loc (레이블 인덱스)

In [7]:
df_n = df.set_index('A')
df_n

      B         C
A
KO   54     Seoul
US   67  New york
EU   89     Paris
US  203        LA
EU  101    London

In [8]:
df_n.iloc[1]

B          67
C    New york
Name: US, dtype: object

In [9]:
df_n.loc['US']

      B         C
A
US   67  New york
US  203        LA

# ix 인덱스

In [10]:
display (df_n.ix['EU'] )
display (df_n.ix[0:2] )

      B       C
A
EU   89   Paris
EU  101  London

     B         C
A
KO  54     Seoul
US  67  New york